# 3. Все чётные числа вывести в другой список
# l = [1,3,4,5,8,9,10,44,22,50,79,54,28,91]

l = [1,3,4,5,8,9,10,44,22,50,79,54,28,91]
ch = []
no_ch = []
for i in l:
    if i % 2 == 0:  # если делиться на 2 без остатка
        ch.append(i) # добавляем i в конец списка ch
print(ch)



l = [1,3,4,5,8,9,10,44,22,50,79,54,28,91]
ch = []
no_ch = []
for i in l:
    if i % 2 == 0:        # если делиться на 2 без остатка
        ch.append(i)      # добавляем i в конец списка ch
    else:                 # иначе
        no_ch.append(i)   # добавляем i ы конец списка no_ch
print(l)
print(ch)
print(no_ch)

    
    